uploads/xml/Travelport-Request-6671d18c1cc62-9785.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:common_v51_0="http://www.travelport.com/schema/common_v51_0" xmlns:univ="http://www.travelport.com/schema/universal_v51_0" TargetBranch="P3763969" TraceId="00c135bdce1184889398bc661a494a9d">
      <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v51_0" OriginApplication="UAPI"/>
      <air:AirItinerary>
        <air:AirSegment ProviderCode="1G" Key="cafwL/8CuDKARDrxKDBAAA==" Group="0" Carrier="EK" FlightNumber="927" Origin="DXB" Destination="CAI" DepartureTime="2024-06-19T08:15:00.000+04:00" ArrivalTime="2024-06-19T11:05:00.000+03:00" FlightTime="230" Distance="1499" ETicketability="Yes" Equipment="388" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Cached status used. Polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="Q" AvailabilityDisplayType="Fare Shop/Optimal Shop"/>
      </air:AirItinerary>
      <air:AirPricingModifiers CurrencyType="SAR"/>
      <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v51_0" Code="ADT" Age="54" BookingTravelerRef="OTEwMDAzOTI2NjcxY2E0MTY3ZTM2MS43Mjc0OTE4NA=="/>
      <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v51_0" Code="ADT" Age="32" BookingTravelerRef="OTEwMDAzOTI2NjcxY2E0MTY4NzMzNC4yNTA2ODA3NQ=="/>
      <air:AirPricingCommand/>
    </air:AirPriceReq>
  </soapenv:Body>
</soapenv:Envelope>
